import React, { Component } from 'react'

export default class About extends Component {
    render() {
        return <>
            <h1 className="text-center display-1">Об агентстве новостей "Перспектива"</h1>
            <p>
                Агентство основано в 1984 году как платформа для обсуждения новостей в мире и не только
                между пользователями тогда ещё только созданной и набиравшей популярность компьютерной сети Fidonet.
            </p>
            <p>
                Со временем "Фидонет" был вытеснен Интернетом, что стало большим горем для руководства агентства и 
                его читателей. 
            </p>
            <p>
                Однако разработчики интернет-версии агентства решили работать не покладая рук, и уже к 2020-му году
                была готова бета-версия "Перспективы" для всемирной паутины, к сожалению ещё требующая доработок.
            </p>
            <p>
                Параллельно с этим, совет директоров агентства принял решение наладить производство автомобилей, 
                парапланов и гелевых ручек ради диверсификации рода деятельности компании. 
            </p>
            <p>
                В начале 2021 года на "ЗАО АГЕНТСТВО НОВОСТЕЙ ПЕРСПЕКТИВА" GmbH Ltd. подали коллективный иск компании
                Erich Krause, Brauberg и Koh-i-Noor Hardtmuth, посчитавшие технологию производства гелевых ручек,
                используемую на заводах "Перспективы", украденной. Агентству пришлось сократить финансирование 
                разработчиков сайта и направить все усилия на сохранение имиджа компании, а также на адвокатов в судах.
            </p>
            <p>
                По итогу долгих судебных разбирательств, в 2022 году агентству пришлось отказаться 
                от создания парапланов и начать производить капиллярные ручки вместо гелевых. 
                Однако ресурсы, направленные на юристов, высвободились, и их направили на разработку сайта.
            </p>
            <p>
                Уже в начале четвёртого квартала 2022 года свет увидела веб-версия агентства "Перспектива".
                Агентство работает и по сей день, предоставляя своим читателем свежий взгляд на вещи и события в мире.
            </p>
        </>
    }
}